app/controllers/admin/sessions_controller.rb

  def create
    admin_admin = Admin::Admin.find_by(email: params[:session][:email].downcase)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = $1  ORDER BY "admins"."id" ASC LIMIT 1  [["email", "baothi246@gmail.com"]]