app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)
    @profile.user_id = current_user.id
    @profile.avatar = params[:avatar]
    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("fristname", "lastname", "brithday", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["fristname", "them "], ["lastname", "moi"], ["brithday", "2015-07-08 02:31:00.000000"], ["user_id", 1], ["created_at", "2015-07-08 02:31:23.328247"], ["updated_at", "2015-07-08 02:31:23.328247"]]

  def update
    # respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "avatar" = $1, "brithday" = $2, "updated_at" = $3 WHERE "profiles"."id" = $4  [["avatar", "11028004_1116732155023179_624699313915988144_n.jpg"], ["brithday", "2015-07-14 12:40:00.000000"], ["updated_at", "2015-07-14 14:14:38.186360"], ["id", 1]]

    def set_profile
      @profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 1]]